let a = Number (prompt("Введите целых числа"));
let b = Number (prompt("введите целое число"));
let Sum = a+b;
let Min = a-b;
let Per = a%b;
let Mul = a*b;
let Div = a/b;
let Deg = a**b;
document.write("Результаты  <br>" + Sum + "<br>" + Min + "<br>" + Per + "<br>" + Mul + "<br>" + Div + "<br>" + Deg )

/*5. Создайте программу, которая запрашивает у пользователя два целых числа **a** и **b**, после чего выводит на экран результаты следующих математических операций: 
    
    - сумма a и b; 
    
    - разница между a и b;
    
    - произведение a и b; 
    
    - частное от деления a на b; 
    
    - остаток от деления a на b;  
    
    - результат возведения числа a в степень b */